Revit 2024 API
BuiltInFailures.StairRampFailures.WinderTooManyStartParallelTreadsOrRunWidthFailure Property
 The number of parallel treads at start is too great or the run width is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WinderTooManyStartParallelTreadsOrRunWidthFailure { get; }
Visual Basic
Public Shared ReadOnly Property WinderTooManyStartParallelTreadsOrRunWidthFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WinderTooManyStartParallelTreadsOrRunWidthFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace